#include "Music.h"

unsigned char code Music_AiCuo[]={
  
    H1, 2, H1, 2, H1, 2, M7, 2, M6, 2, M5, 6,
    M5, 2, M4, 2, M3, 2, M2, 2, M1, 4,
    H1, 2, H1, 2, H1, 2, M7, 2, 
	M6, 2, M5, 4, M4, 2, M3, 2, M2, 8,     
    H1, 2, H1, 2, H1, 2, M7, 2, M6, 2, M5, 4, 
    M6, 2, M7, 2, H1, 4, H2, 2, H1, 2, H3, 4, H1, 1, H2, 8,      
    H3, 2, H2, 2, H1, 2, H2, 4, H1, 1, M6, 5,  
    H3, 2, H2, 2, H1, 2, H1, 2, H1, 2, H2, 2, H3, 2, H2, 10, H3, 6,  
 	M6, 2, H1, 2, H2, 2, H3, 2, H4, 4, H3, 6, 
    H1, 2, H2, 2, H3, 2, H4, 4, H3, 6, 
    H1, 2, H2, 2, H3, 2, H4, 4, H3, 6, 
    H2, 2, H1, 2, M6, 2, H1, 4, H2, 4, 
	M5, 2, H1, 2, H2, 2, H3, 2, H4, 4, H3, 6,     
    H2, 2, H1, 2, H3, 2, H2, 4, H1, 6, 
    H2, 2, H1, 2, M6, 2, H1, 2, H2, 2, H1, 2, M6, 2, H1, 2, 
    H3, 2, H2, 2, H1, 2, H2, 6, 
	H2, 3, H1, 1, H1, 16, 
    V0,16, 0xFF
};

unsigned char code Lyric_AiCuo[][16]={
    
    "北风好不留情",
    "把叶子吹落",
    "坠落的她",
    "选择了逃脱",
    "叶子失去消息",
    "风才感觉寂寞",
    "整个冬天",
    "北风的痛没人能说",
    "我从来没想过",
    "我会这样做",
    "从来没爱过",
    "所以爱错",
    "我从那里起飞",
    "从那里坠落",
    "多少不能原谅的错",
    "却不能重",
    "来过"
};

unsigned char code LyricSwitch_AiCuo[] = {
    0,12,22,30,40,52,68,80,98,
    110,120,130,140,152,162,178,186,192
};
