#include "Music.h"

unsigned char code Music_HuaHai[]={
    M1,2,  M2,2,  M3,2,  M5,1,  M5,9,
    M3,2,  M2,2,  M1,2,  M2,1,  M3,9,
    M1,2,  M2,2,  M3,2,  M7,1,  H1,7,
    H1,2,  M7,2,  M6,2,  M5,2,  M6,1,  M6,2,  M5,7,
    M1,2,  M2,2,  M3,2,  M5,1,  M5,9,
    M3,2,  M2,2,  M1,2,  M2,1,  M1,9,
    M1,2,  M2,2,  M3,2,  M5,2,  M5,2,  M4,2,  M4,2,  M3,2, 
    H1,4,  M3,2,  M3,2,  M2,8,
    M1,2,  M2,2,  M3,2,  M5,1,  M5,9,
    M3,2,  M2,2,  M1,2,  M2,1,  M3,9,
    M1,2,  M2,2,  M3,2,  M7,1,  H1,7,
    H1,2,  M7,2,  M6,2,  M5,2,  M6,1,  M6,2,  M5,7,
    M1,2,  M2,2,  M3,2,  M5,1,  M5,9,
    M3,2,  M2,2,  M1,2,  M2,1,  M1,9,
    M1,2,  M2,2,  M3,2,  M5,1,  M1,9,
    M1,2,  L7,2,  L6,2,  L7,1,  M1,9,
    V0,8, 0xFF
};

unsigned char code Lyric_HuaHai[][16]={
    "不要你离开",
    "距离隔不开",
    "思念变成海",
    "在窗外进不来",
    "原谅说太快",
    "爱成了阻碍",
    "手中的风筝放太快",
    "回不来",
    "不要你离开",
    "回忆划不开",
    "欠你的宠爱",
    "我在等你回来",
    "天空仍灿烂",
    "它爱着大海",
    "情歌被打败",
    "爱已不存在"
};

unsigned char code LyricSwitch_HuaHai[] = {
    0,10,20,30,44,54,64,80,88,98,
    108,118,132,142,152,162
};