#include "Music.h"

unsigned char code Music_QingTian[]={

    M3, 2, M2, 2, M4, 2, M3, 4, M1, 2, M5, 2, M7, 2, 
    H1, 2, M7, 2, M1, 2, M1, 4, 
	M1, 2, M6, 2, M6, 2, V0, 2, M6, 2, M5, 2, M5, 4, 
    M5, 2, M4, 2, M3, 2, M2, 2, M3, 2, M4, 2, M3, 10,   
    M3, 2, M4_, 2, M5_, 2, M3, 4, M4, 2, M5, 2, M7, 2, 
    H2, 2, M7, 2, H1, 2, H1, 6, V0, 2, 
	H1, 2, H1, 2, M5, 2, M5, 2, M6, 2, M5, 1, M4, 1, M4, 2, 
    M2, 2, M3, 2, M4, 2, M5, 2, M6, 2, M1, 2, 
	M6, 3, M7, 1, M7, 4, 
    M3, 2, M2, 2, M4, 2, M3, 4, M1, 2, M5, 2, M7, 2, 
    H1, 2, M7, 2, M1, 2, M1, 4, 
    M1, 2, M6, 2, M6, 2, V0, 2, M6, 2, M5, 2, M5, 4, 
    M5, 2, M4, 2, M3, 2, M2, 2, M3, 2, M4, 2, M3, 10, 
    M3, 2, M4_, 2, M5_, 2, M3, 4, 
    M4, 2, M5, 2, M7, 2, H2, 2, M7, 2, H1, 2, H1, 6, V0, 2, 
    H1, 2, H1, 2, M5, 2, M5, 2, M6, 2, M5, 2,
    M4, 2, L6, 2, L7, 2, M1, 2, M2, 2, M3, 2, M2, 6, 
    M3, 2, M1, 10, 
    V0, 8, 0xFF
};

unsigned char code Lyric_QingTian[][16]={
    
    "刮风这天我试过",
    "握着你手",
    "但偏偏  雨渐渐",
    "大到我看你不见",
    "还要多久 我才能",
    "在你身边",
    "等到放晴的那天",
    "也许我会比较",
    "好一点",
    "从前从前有个人",
    "爱你很久",
    "但偏偏  风渐渐",
    "把距离吹得好远",
    "好不容易",
    "又能再多爱一天",
    "但故事的最后",
    "你好像还是说了",
    "拜拜"
};

unsigned char code LyricSwitch_QingTian[] = {
    0,14,22,36,50,64,74,90,102,108,
    122,130,144,158,166,182,194,208,212
};
