#include "Music.h"

unsigned char code Music_YuAi[]={

    M3, 1, M2, 1, M1, 1, M2, 2, M3, 2, V0, 1, 
	M3, 1, M2, 1, M1, 1, M2, 2, M3, 2, V0, 2, 
	M3, 1, M3, 1, M3, 2, M3, 1, M3, 2, M4, 2, M5, 3, 
	M3, 2, M2, 2, M3, 2, M2, 2, M1, 1, M1, 5, V0, 2, 
	M1, 2, M2, 2, M3, 2, M4, 2, M3, 2, M4, 2, M5, 4, M3, 2, V0, 2, 
	L5, 2, M5, 6, M1, 2, L7, 3, M1, 1, V0, 2, 
	M6, 2, M5, 6, M1, 2, L7, 3, M1, 1, V0, 2, 
	M2, 1, M3, 1, M3, 3, 
	L6, 2, M1, 2, V0, 2, 
	M1, 2, L7, 2, M1, 2, 
	M6, 4, M5, 2, M1, 6, 
    V0, 8, 0xFF
};

unsigned char code Lyric_YuAi[][16]={    

    "窗外的雨滴",
    "一滴滴清晰",
    "你的呼吸像雨滴",
    "渗入我的爱里",
    "真希望雨能下不停",
    "让想念继续",
    "让爱变透明",
    "我爱上",
    "给我",
    "勇气的",
    "Rainie Love"   
};

unsigned char code LyricSwitch_YuAi[] = {
    0,12,24,38,52,70,82,94,100,106,
    112,118
};